In [ ]:
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df

### Sorting

In [2]:
# Sort by Score in descending order
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
df.sort_values(by='Score', ascending=False)

      Name  Score  Age
1      Bob     92   25
3    David     90   24
0    Alice     85   23
2  Charlie     78   22

### Filtering

In [3]:
# Filter students with Score > 80
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
df[df['Score'] > 80]

    Name  Score  Age
0  Alice     85   23
1    Bob     92   25
3  David     90   24

### Using apply function

In [ ]:
# Apply lambda to calculate grade
df['Grade'] = df['Score'].apply(lambda x: 'A' if x >= 90 else ('B' if x >= 80 else 'C'))
df

### Mathematical operations

In [ ]:
# Add 5 bonus points to each score
df['Score Bonus'] = df['Score'] + 5
df

### Combining DataFrames

In [ ]:
# Create another DataFrame and concatenate
new_data = pd.DataFrame({'Name': ['Eve'], 'Score': [88], 'Age': [23], 'Grade': ['B'], 'Score Bonus': [93]})
combined = pd.concat([df, new_data], ignore_index=True)
combined

# L_05: Pandas Operations

Explore various operations in pandas like sorting, filtering, and applying functions.

In [4]:
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df

      Name  Score  Age
0    Alice     85   23
1      Bob     92   25
2  Charlie     78   22
3    David     90   24

### Sorting

In [5]:
# Sort by Score in descending order
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
df.sort_values(by='Score', ascending=False)

      Name  Score  Age
1      Bob     92   25
3    David     90   24
0    Alice     85   23
2  Charlie     78   22

### Filtering

In [6]:
# Filter students with Score > 80
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
df[df['Score'] > 80]

    Name  Score  Age
0  Alice     85   23
1    Bob     92   25
3  David     90   24

### Using apply function

In [9]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
Apply lambda to calculate grade
df['Grade'] = df['Score'].apply(lambda x: 'A' if x >= 90 else ('B' if x >= 80 else 'C'))
df

SyntaxError: invalid syntax (1016324735.py, line 11)

### Mathematical operations

In [10]:
# Add 5 bonus points to each score

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
df['Score Bonus'] = df['Score'] + 5
df

      Name  Score  Age  Score Bonus
0    Alice     85   23           90
1      Bob     92   25           97
2  Charlie     78   22           83
3    David     90   24           95

### Combining DataFrames

In [11]:
# Create another DataFrame and concatenate
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
new_data = pd.DataFrame({'Name': ['Eve'], 'Score': [88], 'Age': [23], 'Grade': ['B'], 'Score Bonus': [93]})
combined = pd.concat([df, new_data], ignore_index=True)
combined

      Name  Score  Age Grade  Score Bonus
0    Alice     85   23   NaN          NaN
1      Bob     92   25   NaN          NaN
2  Charlie     78   22   NaN          NaN
3    David     90   24   NaN          NaN
4      Eve     88   23     B         93.0

# L_05: Pandas Operations

Explore various operations in pandas like sorting, filtering, and applying functions.

In [16]:
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df

      Name  Score  Age
0    Alice     85   23
1      Bob     92   25
2  Charlie     78   22
3    David     90   24

Sorting¶

# Sort by Score in descending order
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
df.sort_values(by='Score', ascending=False)

Filtering

In [18]:
# Filter students with Score > 80
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
df[df['Score'] > 80]

    Name  Score  Age
0  Alice     85   23
1    Bob     92   25
3  David     90   24

Using apply function

In [19]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
Apply lambda to calculate grade
df['Grade'] = df['Score'].apply(lambda x: 'A' if x >= 90 else ('B' if x >= 80 else 'C'))
df

SyntaxError: invalid syntax (428815769.py, line 8)

Mathematical operations¶

In [20]:
# Add 5 bonus points to each score

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
df['Score Bonus'] = df['Score'] + 5
df

      Name  Score  Age  Score Bonus
0    Alice     85   23           90
1      Bob     92   25           97
2  Charlie     78   22           83
3    David     90   24           95

Combining DataFrames